---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecificElementsIntoPerspectiveView
source: html/e54d9b0e-e83f-1423-9277-74add3f089b6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecificElementsIntoPerspectiveView Property

Can't paste view specific elements into perspective view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteViewSpecificElementsIntoPerspectiveView { get; }
```